# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P2/4 - P5/32 outputs optimized for package detection
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes (package detection)
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone with enhanced features for package detection
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, SE, [128]] # Add SE attention for package features
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, CBAM, [256]] # Add CBAM attention for better feature focus
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SE, [512]] # Add SE attention
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CBAM, [1024]] # Add CBAM attention
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0-p2 head optimized for package detection
head:
  # First upsampling path - P4/16
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4 (layer 9 has 512 channels)
  - [-1, 3, C2f, [512]]
  - [-1, 1, SE, [512]] # Add SE attention

  # Second upsampling path - P3/8
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3 (layer 6 has 256 channels)
  - [-1, 3, C2f, [256]]
  - [-1, 1, CBAM, [256]] # Add CBAM attention for small packages

  # Third upsampling path - P2/4 (enhanced for small packages)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P2 (layer 3 has 128 channels)
  - [-1, 4, C2f, [128]] # Increased C2f layers for P2/4
  - [-1, 1, SE, [128]] # Add SE attention
  - [-1, 1, Conv, [128, 3, 1, 1]] # Edge enhancement for package boundaries

  # Downsampling path - P3/8
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 18], 1, Concat, [1]] # cat head P3
  - [-1, 3, C2f, [256]]
  - [-1, 1, CBAM, [256]]

  # Downsampling path - P4/16
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]]
  - [-1, 1, SE, [512]]

  # Downsampling path - P5/32
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]]
  - [-1, 1, CBAM, [1024]]

  # Detection heads for all scales
  - [[22, 25, 28, 31], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
