# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs enhanced with attention modules
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes (package detection)
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
  m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
  l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
  x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS

# YOLOv8.0n backbone with attention modules for package detection
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, SE, [128]] # 3 - Add SE attention for package features
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 6, C2f, [256, True]] # 5
  - [-1, 1, CBAM, [256]] # 6 - Add CBAM attention for better feature focus
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 6, C2f, [512, True]] # 8
  - [-1, 1, SE, [512]] # 9 - Add SE attention
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 3, C2f, [1024, True]] # 11
  - [-1, 1, CBAM, [1024]] # 12 - Add CBAM attention
  - [-1, 1, SPPF, [1024, 5]] # 13

# YOLOv8.0n head with attention modules
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 9], 1, Concat, [1]] # 15 - cat backbone P4 (layer 9 has 512 channels)
  - [-1, 3, C2f, [512]] # 16
  - [-1, 1, SE, [512]] # 17 - Add SE attention

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [[-1, 6], 1, Concat, [1]] # 19 - cat backbone P3 (layer 6 has 256 channels)
  - [-1, 3, C2f, [256]] # 20 (P3/8-small)
  - [-1, 1, CBAM, [256]] # 21 - Add CBAM attention for small packages

  - [-1, 1, Conv, [256, 3, 2]] # 22
  - [[-1, 17], 1, Concat, [1]] # 23 - cat head P4 (layer 17)
  - [-1, 3, C2f, [512]] # 24 (P4/16-medium)
  - [-1, 1, SE, [512]] # 25 - Add SE attention

  - [-1, 1, Conv, [512, 3, 2]] # 26
  - [[-1, 13], 1, Concat, [1]] # 27 - cat head P5 (layer 13)
  - [-1, 3, C2f, [1024]] # 28 (P5/32-large)
  - [-1, 1, CBAM, [1024]] # 29 - Add CBAM attention

  - [[21, 25, 29], 1, Detect, [nc]] # Detect(P3, P4, P5)
