# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs 
# Enhanced with advanced attention modules and package-specific optimizations
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes (package detection)
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
  m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
  l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
  x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS

# YOLOv8.0n backbone with advanced attention modules for package detection
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, SE, [128]] # 3 - SE attention for package features
  - [-1, 1, Conv, [128, 1, 1]] # 4 - Feature refinement
  
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/8
  - [-1, 6, C2f, [256, True]] # 6
  - [-1, 1, CBAM, [256]] # 7 - CBAM attention for better feature focus
  - [-1, 1, Conv, [256, 1, 1]] # 8 - Feature refinement
  
  - [-1, 1, Conv, [512, 3, 2]] # 9-P4/16
  - [-1, 6, C2f, [512, True]] # 10
  - [-1, 1, SE, [512]] # 11 - SE attention
  - [-1, 1, Conv, [512, 1, 1]] # 12 - Feature refinement
  
  - [-1, 1, Conv, [1024, 3, 2]] # 13-P5/32
  - [-1, 3, C2f, [1024, True]] # 14
  - [-1, 1, CBAM, [1024]] # 15 - CBAM attention
  - [-1, 1, Conv, [1024, 1, 1]] # 16 - Feature refinement
  
  - [-1, 1, SPPF, [1024, 5]] # 17 - Spatial pyramid pooling

# YOLOv8.0n head with enhanced attention modules
head:
  # First upsampling path - P4/16
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [[-1, 12], 1, Concat, [1]] # 19 - cat backbone P4 (layer 12 has 512 channels)
  - [-1, 3, C2f, [512]] # 20
  - [-1, 1, SE, [512]] # 21 - SE attention
  - [-1, 1, Conv, [512, 1, 1]] # 22 - Feature refinement

  # Second upsampling path - P3/8
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 23
  - [[-1, 8], 1, Concat, [1]] # 24 - cat backbone P3 (layer 8 has 256 channels)
  - [-1, 3, C2f, [256]] # 25 (P3/8-small)
  - [-1, 1, CBAM, [256]] # 26 - CBAM attention for small packages
  - [-1, 1, Conv, [256, 1, 1]] # 27 - Feature refinement

  # Downsampling path - P4/16-medium
  - [-1, 1, Conv, [256, 3, 2]] # 28
  - [[-1, 22], 1, Concat, [1]] # 29 - cat head P4 (layer 22)
  - [-1, 3, C2f, [512]] # 30 (P4/16-medium)
  - [-1, 1, SE, [512]] # 31 - SE attention
  - [-1, 1, Conv, [512, 1, 1]] # 32 - Feature refinement

  # Downsampling path - P5/32-large
  - [-1, 1, Conv, [512, 3, 2]] # 33
  - [[-1, 17], 1, Concat, [1]] # 34 - cat head P5 (layer 17)
  - [-1, 3, C2f, [1024]] # 35 (P5/32-large)
  - [-1, 1, CBAM, [1024]] # 36 - CBAM attention
  - [-1, 1, Conv, [1024, 1, 1]] # 37 - Feature refinement

  - [[27, 32, 37], 1, Detect, [nc]] # Detect(P3, P4, P5) 